hi buddy,  I have exactly the same problem as you, trying to create a basic repository and I get the `Error: error reading current user: undefined response type`.
Then I tried the same resource as you did `bitbucket_current_user` and it's the same.

You mentioned that the solution was to remove the "." in the repo slug and you were able to create a repo, but what about the `bitbucket_current_user` ? This should have worked initially for me/you, but it doesn't.

Any help is appreciated, here is the resource and the TF output:
```
resource "bitbucket_repository" "market_repository" {
  owner = "Platform-team"
  name  = var.repo_name
  project_key = "PI" # Platform Infrastructure project
  pipelines_enabled = true
}
```

```
Terraform will perform the following actions:

  # bitbucket_repository.market_repository will be created
  + resource "bitbucket_repository" "market_repository" {
      + clone_https       = (known after apply)
      + clone_ssh         = (known after apply)
      + fork_policy       = "allow_forks"
      + has_issues        = false
      + has_wiki          = false
      + id                = (known after apply)
      + is_private        = true
      + name              = "nik-test-repo"
      + owner             = "Platform-team"
      + pipelines_enabled = true
      + project_key       = "PI"
      + scm               = "git"
      + slug              = (known after apply)
      + uuid              = (known after apply)

      + link {
          + avatar {
              + href = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

bitbucket_repository.market_repository: Creating...
╷
│ Error: error creating repository (nik-test-repo): undefined response type
│
│   with bitbucket_repository.market_repository,
│   on main.tf line 2, in resource "bitbucket_repository" "market_repository":
│    2: resource "bitbucket_repository" "market_repository" {
│
```